<a href="https://colab.research.google.com/github/oyuka1112/oyuka1112/blob/main/draftDf.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [2]:
import pandas as pd
from matplotlib import pyplot as plt

In [244]:
#import all the files
contacts = pd.read_excel(r'Df_contacts.txt.xlsx')  #.set_index("CONT_ID") #set index as ID 
mails= pd.read_excel(r'Df_mails.xlsx')  #.set_index("MAIL_ID")
responses= pd.read_excel(r'Df_responses.xlsx')  #.set_index("RESPONSE_ID")
conversions= pd.read_excel(r'Df_conversion.xlsx')  #.set_index("CONV_ID")

In [199]:
contacts.tail()

     CONT_ID          NAME        CITY STATE   ZIP5
195      196  SHAWN LITTLE  MOORESTOWN    NY  85268
196      197  ALBIN NELSON  ORANGEBURG    IA  93704
197      198  STEVE GOEREE   SOUTHLAKE    AL  50125
198      199   JOAN BURILL    CARLSBAD    FL  21401
199      200  JOHN MCNULTY        LULA    FL  77338

In [333]:
mails.tail()

     MAIL_ID  CONT_ID  MAIL_MONTH  MAIL_DATE
295      296        4          10 2015-10-23
296      297       41           5 2017-05-14
297      298       49          12 2016-12-16
298      299      120           7 2018-07-21
299      300      150          12 2018-12-22

In [65]:
responses.tail()

     RESPONSE_ID  MAIL_ID  RESP_DATE
195          196      234 2019-04-22
196          197      272 2019-03-18
197          198       18 2019-12-18
198          199      198 2019-12-17
199          200       47 2019-03-18

In [71]:
conversions.tail()

    CONV_ID  RESPONSE_ID  CONV_DATE
45       46          170 2020-06-01
46       47           24 2020-11-08
47       48           78 2020-07-24
48       49          182 2020-03-03
49       50           43 2020-12-26

In [335]:
mails.sort_values(by = "MAIL_DATE", axis = 0 )
mails['CONT_ID'].nunique

<bound method IndexOpsMixin.nunique of 0       35
1       50
2      148
3      121
4       28
      ...
295      4
296     41
297     49
298    120
299    150
Name: CONT_ID, Length: 300, dtype: int64>

In [45]:
df1 = pd.merge(conversions, responses  , on=['RESPONSE_ID'], how='inner').sort_values('RESPONSE_ID')
# df1 = conversions.set_index('RESPONSE_ID').join(responses.set_index('RESPONSE_ID')).sort_index()

In [46]:
df2 = pd.merge(df1, mails  , on=['MAIL_ID'], how='inner').sort_values('MAIL_ID')
df3 = pd.merge(df2, contacts  , on=['CONT_ID'], how='inner').sort_values("CONT_ID").sort_index()
#df2 = df1.set_index('MAIL_ID').join(mails.set_index('MAIL_ID')).sort_index()
df4 = df3['CONT_ID'].drop_duplicates()

In [66]:
df4 = df4.drop(columns = ['CONV_ID', 'RESPONSE_ID', 'MAIL_ID', 'RESP_DATE', 'CONT_ID', 'MAIL_MONTH', 'CITY', 'STATE', 'ZIP5'])

In [73]:
df4.tail()

    CONV_DATE  MAIL_DATE             NAME
45 2020-03-26 2015-03-19  ERNESTO MATHEWS
46 2020-03-03 2015-10-07       PING RENGA
47 2020-11-28 2018-06-08     MICHAEL RAUB
48 2020-05-04 2015-04-26          J SOLIS
49 2020-05-03 2018-12-22      MARIA COYLE

In [246]:
#Ex 8
names = contacts['NAME']
names = names.to_frame()
names = names['NAME'].str.split(',', expand = True).add_prefix('NAME')
names1 = names['NAME0'].str.split(',', expand = True).add_prefix('NAME')
contacts['FIRST NAME'] = names1['NAME0'].str.split().str[0].astype(str, errors='ignore')
contacts['LAST NAME'] = names1['NAME0'].str.split().str[-1].astype(str, errors='ignore')
contacts['LAST NAME'] = contacts['LAST NAME'].str.split('-').str[-1].astype(str, errors='ignore')

In [236]:
# names = names.drop('NAME1', axis = 1)

In [245]:
# contacts.rename(columns={0: "NAME"}).drop(columns = 1)
# names = names.rename(columns={'NAME0': "NAME"})
# names = names.drop(columns = 'NAME', axis = 1)
# names

In [41]:
# Ex 9
# contacts_only_MD = contacts[contacts.STATE =='MD']
# contacts_only_MD
contacts.loc[contacts.STATE == 'MD']

     CONT_ID               NAME       CITY STATE   ZIP5
57        58  JOE COVEY LANDERS  URBANDALE    MD  11801
120      121    ROBERT LUNDGREN    SHAWNEE    MD  23227
125      126  PATRICK STALLINGS  CHARLOTTE    MD   5476
162      163      MICHAEL HOUCK  SOUTHAVEN    MD  11729
164      165        JAMES HEITZ      JENKS    MD  93727
184      185          JOE ALERS   NEW BERN    MD   3031
185      186         USA PEGORS  EL DORADO    MD  97504

In [26]:
#EX4
#responses.info()
#Date is in datetime
# dt = responses['RESP_DATE']
# responses.RESP_DATE[0]
from datetime import datetime

df = responses['RESP_DATE'].groupby(responses.RESP_DATE.dt.month).agg('count')
df.idxmax()  #hariu ni ene bn

df.max()
df
# for i in range(0,200):
#   date =[]
#   date[i] = datetime.strptime(str(responses.RESP_DATE[i]), '%Y-%m-%d %H:%M:%S')
#   date_object.month

# def date_convert(date_to_convert):
#      return datetime.datetime.strptime(date_to_convert, '%b %d, %Y').strftime('%m/%d/%Y')

# responses['RESP_DATE']= responses['RESP_DATE'].apply(date_convert)
# responses['d'] = responses['RESP_DATE'].apply(lambda x: datetime.strptime(x, '%Y%m%d%H'))

RESP_DATE
1     20
2     14
3     21
4     24
5     16
6     16
7     15
8     11
9     14
10    13
11    19
12    17
Name: RESP_DATE, dtype: int64

In [ ]:
# from datetime import datetime
# def days_between(d1, d2):
#     d1 = datetime.strptime(d1, "%Y-%m-%d")
#     d2 = datetime.strptime(d2, "%Y-%m-%d") 
#     return abs((d2 - d1).days)
# print days_between('2013-05-06', '2013-06-06')

In [31]:
#Ex 5
df_con = conversions['CONV_DATE'].groupby(conversions.CONV_DATE.dt.month).agg('count')
import calendar
df_con.idxmax() #number
calendar.month_name[df_con.idxmax()] #convert to month

'May'

In [60]:
#ex7 verbose mail month
mails['VERBOSE_MAIL_MONTH'] = mails['MAIL_MONTH'].apply(lambda x: calendar.month_abbr[x])

In [218]:
#Ex 2 response per city
new = mails.drop_duplicates(subset =['CONT_ID'], keep = 'first')
dff1 = pd.merge(responses, new  , on=['MAIL_ID'], how='inner').sort_values("MAIL_ID")
# dff1['CONT_ID'] = dff1.drop_duplicates(subset =['CONT_ID'], keep = 'first') #.sort_index()
dff2 = pd.merge(dff1, contacts  , on=['CONT_ID'], how='inner').sort_values("CONT_ID").sort_index()
# pd.set_option("display.max_rows", None, "display.max_columns", None)
# dff2[['CITY']].nunique() #check unique values in city column
dff2['CITY_STATE'] = dff2[['CITY', 'STATE']].agg(', '.join, axis=1)
# dff2[['CITY_STATE']].value_counts()
series=(dff2['CITY_STATE'].value_counts()/dff2['CITY_STATE'].count())*100
series1 = series.to_frame()
series1=series1.reset_index().rename(columns ={'index':'CITY_STATE', 'CITY_STATE':'PERCENTAGE'})
series1["PERCENTAGE"] = (series1.PERCENTAGE).apply(lambda x: round(x,2))
# # dff2['Per'] = dff2.apply(lambda x :( x['CITY_STATE'].value_counts() / x['CITY_STATE'].count() ) *100 )
# dff2
# series1

In [247]:
# 6.	Given that each primary key columns (PK) is indexed properly, please give an estimate run time for the following joins
# a.	1MM contacts LEFT JOIN to 10MM Mail Pieces
# b.	5MM contacts INNER JOIN to 10MM Mail Pieces LEFT JOIN to 4.25MM Responses
import timeit